bit-finance/Enums/бит_МетодыОбработкиВложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_МетодыОбработкиВложений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>APIМодели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрокаBase64</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисРаспознавания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ФорматыВыгрузкиОтчетовВИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ФорматыВыгрузкиОтчетовВИИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CSV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_РолиВзаимодействияИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РолиВзаимодействияИИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>System</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Developer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>User</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Assistant</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Notice</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_АссистентыИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_АссистентыИИ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_МоделиИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аватарка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СлужебныеПромпты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Промпт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныПромптовИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Catalogs/бит_МоделиИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_МоделиИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПоставщикиИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМодели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифGigaChat</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРесурсаФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодОбработкиВложений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_МетодыОбработкиВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикРаспознаванияДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезопасноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиИспользоватьАутентификациюОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/CommonModules/бит_ИскусственныйИнтеллектКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Конструктор параметров взаимодействия с моделью ИИ.
//
// Возвращаемое значение:
//	Структура.
//
Функция НовыеПараметрыВзаимодействияСМоделью() Экспорт
	
	ПараметрыВзаимодействия = Новый Структура;
	ПараметрыВзаимодействия.Вставить("Ассистент", ПредопределенноеЗначение("Справочник.бит_АссистентыИИ.ПустаяСсылка"));
	ПараметрыВзаимодействия.Вставить("Модель", ПредопределенноеЗначение("Справочник.бит_МоделиИИ.ПустаяСсылка"));
	ПараметрыВзаимодействия.Вставить("ЗапросПользователя"); // Строка или Массив.
	ПараметрыВзаимодействия.Вставить("Поведение", ""); // Поведение и стиль модели (общедоступно, влияет на все ответы).
	ПараметрыВзаимодействия.Вставить("ТехническиеУказания", ""); // Служебные промпты указанные в ассистенте.
	ПараметрыВзаимодействия.Вставить("Температура", 0); // min 0, max 2
	ПараметрыВзаимодействия.Вставить("Поставщик", ПредопределенноеЗначение("Перечисление.бит_ПоставщикиИИ.ПустаяСсылка"));
	ПараметрыВзаимодействия.Вставить("МетодОбработкиВложений",
		ПредопределенноеЗначение("Перечисление.бит_МетодыОбработкиВложений.ПустаяСсылка"));
	ПараметрыВзаимодействия.Вставить("АдресРесурсаФайлов", "");
	ПараметрыВзаимодействия.Вставить("ОбработчикРаспознаванияДокументов", "");
	ПараметрыВзаимодействия.Вставить("ВидМодели", "");
	ПараметрыВзаимодействия.Вставить("КлючAPI", "");
	ПараметрыВзаимодействия.Вставить("ИдентификаторКаталога", "");
	ПараметрыВзаимодействия.Вставить("ЭтоЯндекс", Ложь);
	ПараметрыВзаимодействия.Вставить("ЭтоСбер", Ложь);
	ПараметрыВзаимодействия.Вставить("ЭтоGemini", Ложь);
	
	ПараметрыСервера = Новый Структура;
	ПараметрыСервера.Вставить("Сервер",       "");
	ПараметрыСервера.Вставить("Ресурс",       "");
	ПараметрыСервера.Вставить("РесурсФайлов", "");
	ПараметрыСервера.Вставить("Порт",         Неопределено);
	ПараметрыСервера.Вставить("ИспользоватьБезопасноеСоединение", Истина);
	ПараметрыВзаимодействия.Вставить("ПараметрыСервера", ПараметрыСервера);
	
	ПараметрыПрокси = Новый Структура;
	ПараметрыПрокси.Вставить("ИспользоватьПрокси",           Ложь);
	ПараметрыПрокси.Вставить("Сервер",                       "");
	ПараметрыПрокси.Вставить("Порт",                         Неопределено);
	ПараметрыПрокси.Вставить("ИспользоватьАутентификациюОС", Ложь);
	ПараметрыПрокси.Вставить("Пользователь",                 "");
	ПараметрыПрокси.Вставить("Пароль",                       "");
	ПараметрыВзаимодействия.Вставить("ПараметрыПрокси", ПараметрыПрокси);
	
	Возврат ПараметрыВзаимодействия;
	
КонецФункции

// Отправляет запрос к модели ИИ.
//
// Параметры:
//	ПараметрыВзаимодействия - Структура - см. НовыеПараметрыВзаимодействияСМоделью()
//
// Возвращаемое значение:
//	Структура.
//
Функция ВзаимодействиеСМоделью(ПараметрыВзаимодействия) Экспорт
	
	Если ПараметрыВзаимодействия.ЭтоGemini Тогда
		Возврат РезультатГенерацииGemini(ПараметрыВзаимодействия);
	КонецЕсли;
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	ПараметрыСервера = ПараметрыВзаимодействия.ПараметрыСервера;
	ПараметрыЗапроса.АдресСервера = ПараметрыСервера.Сервер; 
	ПараметрыЗапроса.Порт         = ПараметрыСервера.Порт;
	ПараметрыЗапроса.АдресРесурса = ПараметрыСервера.Ресурс;
	ПараметрыЗапроса.ИспользоватьБезопасноеСоединение = ПараметрыСервера.ИспользоватьБезопасноеСоединение;
	ПараметрыЗапроса.ПараметрыПрокси = ПараметрыВзаимодействия.ПараметрыПрокси;
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",  "application/json");
	Если НЕ ПустаяСтрока(ПараметрыВзаимодействия.КлючAPI) Тогда
		ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer " + ПараметрыВзаимодействия.КлючAPI);
	КонецЕсли;
	
	ТелоЗапроса = ТелоЗапросаКМодели(ПараметрыВзаимодействия);
	ПараметрыЗапроса.ТелоЗапроса = ЗначениеВJSON(ТелоЗапроса);

	Результат = РезультатHTTPЗапроса(ПараметрыЗапроса);
	Если Результат.ЗапросВыполнен Тогда
		ОтветСервера = Результат.ОтветСервера;
		Если ПараметрыВзаимодействия.ЭтоЯндекс Тогда
			ОтветСервера = ОтветСервера["result"]["alternatives"][0]["message"]["text"];
		Иначе
			ОтветСервера = ОтветСервера["choices"][0]["message"]["content"];
		КонецЕсли;
		Результат.ОтветСервера = ОтветСервера;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конструктор параметров функции ПреобразоватьДанныеДляПередачиАссистенту().
//
// Возвращаемое значение:
//	Структура:
//	* Данные - Произвольное значение - Данные, которые необходимо преобразовать в текст передачи ассистенту.
//	* ФорматВыгрузки - ПеречислениеСсылка.бит_ФорматыВыгрузкиОтчетовВИИ - Формат преобразования табличных документов.
//
Функция НовыеПараметрыПреобразованияДанных() Экспорт
	
	ПараметрыПреобразования = Новый Структура;
	
	ПараметрыПреобразования.Вставить("Данные", Неопределено);
	ПараметрыПреобразования.Вставить("ФорматВыгрузки",
		ПредопределенноеЗначение("Перечисление.бит_ФорматыВыгрузкиОтчетовВИИ.CSV"));
		
	Возврат ПараметрыПреобразования;
	
КонецФункции

// Преобразует данные в текст для передачи ассистенту.
//
// Параметры:
//	ПараметрыПреобразования - Структура - См. НовыеПараметрыПреобразованияДанных()
//
// Возвращаемое значение:
//	Строка.
//
Функция ПреобразоватьДанныеДляПередачиАссистенту(ПараметрыПреобразования) Экспорт
	
	#Если ВебКлиент Тогда
		Возврат бит_ИскусственныйИнтеллектВызовСервера.ПреобразоватьДанныеДляПередачиАссистенту(ПараметрыПреобразования);
	#Иначе
		ДанныеСтрокой = "";
		
		Данные         = ПараметрыПреобразования.Данные;
		ФорматВыгрузки = ПараметрыПреобразования.ФорматВыгрузки;
		
		Если ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.бит_ФорматыВыгрузкиОтчетовВИИ.CSV") Тогда
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("csv");
			Данные.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.TXT);
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ИмяВременногоФайла);
			ДанныеСтрокой = ТекстовыйДокумент.ПолучитьТекст();
			УдалитьФайлы(ИмяВременногоФайла);
		ИначеЕсли ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.бит_ФорматыВыгрузкиОтчетовВИИ.JSON") Тогда
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Данные, НазначениеТипаXML.Явное);
			ДанныеСтрокой = ЗаписьJSON.Закрыть();
		КонецЕсли;
		
		Возврат ДанныеСтрокой;
	#КонецЕсли
	
КонецФункции

#Если Клиент Или ВебКлиент Тогда
// Выполняет обработку команды по передаче данных результата отчета для обсуждения с ИИ.
//
// Параметры:
//	Форма - ФормаОтчета,
//	Команда - КомандаФормы,
//	ТабличныйДокумент - ТабличныйДокумент,
//	ПредставлениеОтчета - Строка.
//
Процедура ОбсудитьОтчетСИИ(Форма, Команда, ТабличныйДокумент, ПредставлениеОтчета = "") Экспорт
	
	Перем ФорматВыгрузки, Описание, ТекстВыгрузки;
	
	ИмяКоманды = Команда.Имя;
	Для каждого СтрокаКоманды Из Форма.бит_ОписанияОтчетаДляИИ Цикл
		Если СтрокаКоманды.ИмяКомандыВзаимодействия <> ИмяКоманды Тогда
			Продолжить;
		КонецЕсли;
		ФорматВыгрузки = СтрокаКоманды.ФорматВыгрузки;
		Описание       = СтрокаКоманды.Описание;
		ВариантОтчета  = СтрокаКоманды.ВариантОтчета;
		Прервать;
	КонецЦикла;
	
	ПараметрыПреобразования = НовыеПараметрыПреобразованияДанных();
	ПараметрыПреобразования.Данные         = ТабличныйДокумент;
	ПараметрыПреобразования.ФорматВыгрузки = ФорматВыгрузки;
	ТекстВыгрузки = ПреобразоватьДанныеДляПередачиАссистенту(ПараметрыПреобразования);
	Если ПустаяСтрока(ТекстВыгрузки) Тогда
		Возврат;
	КонецЕсли;
	
	ФормаВзаимодейсвия = ПолучитьФорму("Обработка.бит_ВзаимодейтсвиеСИИ.Форма");
	Если ФормаВзаимодейсвия.Открыта() Тогда
		ФормаВзаимодейсвия.Активизировать();
	Иначе
		ФормаВзаимодейсвия.Открыть();
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ВариантОтчета) Тогда
		Если ПустаяСтрока(ПредставлениеОтчета) Тогда
			ПредставлениеОтчета = ВариантОтчета;
		Иначе
			ПредставлениеОтчета = СтрШаблон("%1: %2", ПредставлениеОтчета, ВариантОтчета);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ДанныеОтчета",        ТекстВыгрузки);
	ПараметрыОтчета.Вставить("ФорматВыгрузки",      ФорматВыгрузки);
	ПараметрыОтчета.Вставить("Описание",            Описание);
	ПараметрыОтчета.Вставить("ПредставлениеОтчета", ПредставлениеОтчета);
	Оповестить("ПередачаДанныхОтчетаВИИ", ПараметрыОтчета, ФормаВзаимодейсвия);
	
КонецПроцедуры
#КонецЕсли

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СериализацияJSON

// Преобразует строку в формате JSON в значение при помощи метода глобального контекста ПрочитатьJSON.
// См. ограничения в синтакс-помощнике.
// Объекты JSON по умолчанию преобразует в значения типа Соответствие. 
// Имена свойств со значением типа Дата необходимо явно указывать, чтобы было выполнено преобразование.
// Ожидаемый формат дат - ISO (YYYY-MM-DDThh:mm:ssZ).
// 
// Параметры:
//   Строка - Строка - значение в формате JSON.
//   ИменаСвойствСоЗначениямиДата - Строка - имя свойства, содержащее значение типа Дата. Допустимо указывать несколько
//                                           свойств через запятую.
//                                - Массив из Строка 
//   ПрочитатьВСоответствие       - Булево - если Ложь, то объекты JSON будут преобразованы в значение типа Структура.
//   
// Возвращаемое значение:
//  Произвольный
//
Функция JSONВЗначение(Знач Строка, Знач ИменаСвойствСоЗначениямиДата = Неопределено, Знач ПрочитатьВСоответствие = Истина) Экспорт
	
	#Если ВебКлиент Тогда
		Возврат бит_ИскусственныйИнтеллектВызовСервера.JSONВЗначение(Строка, ИменаСвойствСоЗначениямиДата, ПрочитатьВСоответствие);
	#Иначе
		Если ТипЗнч(ИменаСвойствСоЗначениямиДата) = Тип("Строка") Тогда
			ИменаСвойствСоЗначениямиДата = СтрРазделить(ИменаСвойствСоЗначениямиДата, ", " + Символы.ПС, Ложь);
		КонецЕсли;
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Строка);
		
		Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	#КонецЕсли
	
КонецФункции

// Преобразует значение в строку JSON при помощи метода глобального контекста ЗаписатьJSON.
// Допускаются не все типы значений, подробности см. в синтакс-помощнике.
// Даты преобразуются в формат ISO (YYYY-MM-DDThh:mm:ssZ).
// 
// Параметры:
//  Значение - Произвольный
//
// Возвращаемое значение:
//  Строка
//
Функция ЗначениеВJSON(Знач Значение) Экспорт
	
	#Если ВебКлиент Тогда
		Возврат бит_ИскусственныйИнтеллектВызовСервера.ЗначениеВJSON(Значение);
	#Иначе
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Значение);
		
		Возврат ЗаписьJSON.Закрыть();
	#КонецЕсли
	
КонецФункции

Функция СериализуемоеЗначениеДляВыгрузкиJSON(Знач Значение) Экспорт
	
	СериализуемоеЗначение = Значение;
	ТипЗначения = ТипЗнч(Значение);
	Если бит_ОбщегоНазначенияКлиентСервер.ЭтоПримитивныйТип(ТипЗначения) Тогда
		Возврат СериализуемоеЗначение;
	КонецЕсли;
	
	Если ТипЗначения = Тип("Структура")
		ИЛИ ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		СериализуемоеЗначение = Новый Структура;	
		Для каждого ЭлементДанных Из Значение Цикл
			СериализуемоеЗначение.Вставить(ЭлементДанных.Ключ, СериализуемоеЗначениеДляВыгрузкиJSON(ЭлементДанных.Значение));
		КонецЦикла;
	ИначеЕсли ТипЗначения = Тип("Соответствие")
		ИЛИ ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		СериализуемоеЗначение = Новый Соответствие;	
		Для каждого ЭлементДанных Из Значение Цикл
			СериализуемоеЗначение.Вставить(ЭлементДанных.Ключ, СериализуемоеЗначениеДляВыгрузкиJSON(ЭлементДанных.Значение));
		КонецЦикла;
	ИначеЕсли ТипЗначения = Тип("ТаблицаЗначений") Тогда
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			СериализуемоеЗначение = СериализуемоеЗначениеДляВыгрузкиJSON(ОбщегоНазначения.ТаблицаЗначенийВМассив(Значение));
		#КонецЕсли
	ИначеЕсли ТипЗначения = Тип("Массив") ИЛИ ТипЗначения = Тип("ФиксированныйМассив") Тогда
		СериализуемоеЗначение = Новый Массив;
		Для каждого ЭлементДанных Из Значение Цикл
			СериализуемоеЗначение.Добавить(СериализуемоеЗначениеДляВыгрузкиJSON(ЭлементДанных));
		КонецЦикла;
	Иначе
		СериализуемоеЗначение = Строка(Значение);
	КонецЕсли;
	
	Возврат СериализуемоеЗначение;
	
КонецФункции

Функция ИзвлечьДанныеJSONИзГенеративнойСтроки(Знач Строка, Знач ИменаСвойствСоЗначениямиДата = Неопределено, Знач ПрочитатьВСоответствие = Истина) Экспорт
	
	Попытка
		Значение = JSONВЗначение(Строка, ИменаСвойствСоЗначениямиДата, ПрочитатьВСоответствие);
		Возврат Значение;
	Исключение
	КонецПопытки;
		
	СчетчикКонструкций = 0;
	НачалоОписания     = 0;
	Для ТекущийСимвол = 1 По СтрДлина(Строка) Цикл
		КодСимвола = КодСимвола(Строка, ТекущийСимвол);
		Если КодСимвола = КодСимвола("[") ИЛИ КодСимвола = КодСимвола("{") Тогда
			СчетчикКонструкций = СчетчикКонструкций + 1;
			Если НачалоОписания = 0 Тогда
				НачалоОписания = ТекущийСимвол;
			КонецЕсли;
		ИначеЕсли КодСимвола = КодСимвола("]") ИЛИ КодСимвола = КодСимвола("}") Тогда
			СчетчикКонструкций = СчетчикКонструкций - 1;
			Если СчетчикКонструкций = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаJSON = Сред(Строка, НачалоОписания, ТекущийСимвол - НачалоОписания + 1);
	Попытка
		Значение = JSONВЗначение(СтрокаJSON, ИменаСвойствСоЗначениямиДата, ПрочитатьВСоответствие);
		Возврат Значение;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область РаботаСHTML

Функция ОбработанныйТекстДляHTML(Знач Текст) Экспорт
	
	ВставитьПереносыСтрокHTML(Текст);
	ВыделитьКурсивHTML(Текст);
	ВыделитьЗаголовкиHTML(Текст);
	
	Возврат Текст;
	
КонецФункции

Функция НовыеПараметрыОформленияHTML() Экспорт
	
	ПараметрыОформления = Новый Структура;
	
	ПараметрыОформления.Вставить("Выравнивание", ГоризонтальноеПоложение.Авто);
	ПараметрыОформления.Вставить("ЦветТекста",   "");
	ПараметрыОформления.Вставить("ЦветФона",     "");
	ПараметрыОформления.Вставить("Жирное",       Ложь);
	ПараметрыОформления.Вставить("Курсив",       Ложь);
	
	Палитра = Новый Соответствие;
	Палитра.Вставить("Белый",         "250, 250, 250");
	Палитра.Вставить("Зеленый",       "0, 125, 0");
	Палитра.Вставить("СветлоЗеленый", "225, 255, 225");
	Палитра.Вставить("СветлоСерый",   "220, 220, 220");
	Палитра.Вставить("Серый",         "125, 125, 125");
	ПараметрыОформления.Вставить("Палитра", Палитра);
	
	Возврат ПараметрыОформления;
	
КонецФункции

Функция ТекстСообщенияHTMLСОформлением(ТекстСообщения, ПараметрыОформления) Экспорт
	
	ТекстСообщенияHTML = ТекстСообщения;
	
	Палитра    = ПараметрыОформления.Палитра;
	
	ЦветФона   = Палитра.Получить(ПараметрыОформления.ЦветФона);
	ЦветТекста = Палитра.Получить(ПараметрыОформления.ЦветТекста);
	
	Если ПараметрыОформления.Жирное Тогда
		ШаблонОформления = "<b>%1</b>";
		ТекстСообщенияHTML = СтрШаблон(ШаблонОформления, ТекстСообщенияHTML);
	КонецЕсли;
	
	Если ПараметрыОформления.Курсив Тогда
		ШаблонОформления = "<i>%1</i>";
		ТекстСообщенияHTML = СтрШаблон(ШаблонОформления, ТекстСообщенияHTML);
	КонецЕсли;
	
	Если ЦветФона <> Неопределено ИЛИ ЦветТекста <> Неопределено Тогда
		ШаблонЦвета = "%1: rgb(%2);";
		ОформлениеЦвета = "";
		Если ЦветФона <> Неопределено Тогда
			ОформлениеЦвета = ОформлениеЦвета + СтрШаблон(ШаблонЦвета, "background-color", ЦветФона);
		КонецЕсли;
		Если ЦветТекста <> Неопределено Тогда
			ОформлениеЦвета = ОформлениеЦвета + СтрШаблон(ШаблонЦвета, "color", ЦветТекста);
		КонецЕсли;
		
		ШаблонРаскраски = "<span style=""%1"">%2</span>";
		ТекстСообщенияHTML = СтрШаблон(ШаблонРаскраски, ОформлениеЦвета, ТекстСообщенияHTML);
	КонецЕсли;
	
	Если ПараметрыОформления.Выравнивание <> ГоризонтальноеПоложение.Авто Тогда
		ШаблонВыравнивания = "<div style=""text-align: %1;"">%2</div>";
		Выравнивание       = "left";
		Если ПараметрыОформления.Выравнивание = ГоризонтальноеПоложение.Центр Тогда
			Выравнивание = "center";
		ИначеЕсли ПараметрыОформления.Выравнивание = ГоризонтальноеПоложение.Право Тогда
			Выравнивание = "right";
		КонецЕсли;
		ТекстСообщенияHTML = СтрШаблон(ШаблонВыравнивания, Выравнивание, ТекстСообщенияHTML);
	КонецЕсли;
	
	Возврат ТекстСообщенияHTML;
	
КонецФункции

#КонецОбласти

Функция НовыеПараметрыHTTPЗапроса() Экспорт
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("АдресСервера",                     "");
	ПараметрыЗапроса.Вставить("Порт",                             Неопределено);
	ПараметрыЗапроса.Вставить("ИспользоватьБезопасноеСоединение", Истина);
	ПараметрыЗапроса.Вставить("АдресРесурса",                     "");
	ПараметрыЗапроса.Вставить("АдресРесурсаФайлов",               "");
	ПараметрыЗапроса.Вставить("Заголовки",                        Новый Соответствие);
	ПараметрыЗапроса.Вставить("ТелоЗапроса",                      "");
	ПараметрыЗапроса.Вставить("ЗапросЧерезПоток",                 Ложь);
	ПараметрыЗапроса.Вставить("HTTPЗапрос",                       Неопределено);
	
	ПараметрыПрокси = Новый Структура;
	ПараметрыПрокси.Вставить("ИспользоватьПрокси",           Ложь);
	ПараметрыПрокси.Вставить("Сервер",                       "");
	ПараметрыПрокси.Вставить("Порт",                         0);
	ПараметрыПрокси.Вставить("ИспользоватьАутентификациюОС", Ложь);
	ПараметрыПрокси.Вставить("Пользователь",                 "");
	ПараметрыПрокси.Вставить("Пароль",                       "");
	ПараметрыЗапроса.Вставить("ПараметрыПрокси", ПараметрыПрокси);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция РезультатHTTPЗапроса(ПараметрыЗапроса) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапросВыполнен", Ложь);
	Результат.Вставить("ОтветСервера", "");
	
	Соединение = HTTPСоединениеСМоделью(ПараметрыЗапроса);
	
	Если ПараметрыЗапроса.ЗапросЧерезПоток Тогда
		HTTPЗапрос = ПараметрыЗапроса.HTTPЗапрос;
	Иначе
		HTTPЗапрос = Новый HTTPЗапрос(ПараметрыЗапроса.АдресРесурса, ПараметрыЗапроса.Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыЗапроса.ТелоЗапроса);
	КонецЕсли;
	
	Попытка
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписатьОшибкуВЖурналРегистрации(СтрШаблон(
			НСтр("ru = 'Не удалось установить соединение с сервером %1 по причине:
			|%2'"), ПараметрыЗапроса.АдресСервера, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)));
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось установить соединение с сервером по причине:
							|%1'"),ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		Результат.Вставить("ОтветСервера", ТекстОшибки);
		Возврат Результат;
	КонецПопытки;
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		ОтветСервера = HTTPОтвет.ПолучитьТелоКакСтроку();
		ТекстОшибки  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Запрос ""%1"" не выполнен. Код состояния: %2.'"),
			HTTPЗапрос.АдресРесурса,
			HTTPОтвет.КодСостояния) + Символы.ПС + ОтветСервера;
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		Если HTTPОтвет.КодСостояния = 401 
			ИЛИ HTTPОтвет.КодСостояния = 403 Тогда
			ИнформацияОбОшибке = JSONВЗначение(HTTPОтвет.ПолучитьТелоКакСтроку());
			ОписаниеОшибки     = ИнформацияОбОшибке.Получить("error");
			Если ОписаниеОшибки = Неопределено Тогда
				ОписаниеОшибки = ИнформацияОбОшибке;
			КонецЕсли;
			ОтветСервера = ОписаниеОшибки.Получить("message");
			Если ОтветСервера = Неопределено Тогда
				ОтветСервера = ОписаниеОшибки;
			КонецЕсли;
		КонецЕсли;
		Результат.Вставить("ОтветСервера", ОтветСервера);
	Иначе
		Результат.Вставить("ЗапросВыполнен", Истина);
		Результат.Вставить("ОтветСервера", JSONВЗначение(HTTPОтвет.ПолучитьТелоКакСтроку()));
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьHTTPЗапросДляРаботыСПотоком(ПараметрыЗапроса) Экспорт
	
	ПараметрыЗапроса.ЗапросЧерезПоток = Истина;
	ПараметрыЗапроса.HTTPЗапрос = Новый HTTPЗапрос(ПараметрыЗапроса.АдресРесурса, ПараметрыЗапроса.Заголовки);
	
КонецПроцедуры

Функция НовоеОписаниеФайлаВыгрузки(ПолноеИмяФайла = "") Экспорт
	
	ОписаниеФайла = Новый Структура;
	ОписаниеФайла.Вставить("Имя",              "");
	ОписаниеФайла.Вставить("ИмяБезРасширения", "");
	ОписаниеФайла.Вставить("Расширение",       "");
	
	Если НЕ ПустаяСтрока(ПолноеИмяФайла) Тогда
		ИнформацияОФайле = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолноеИмяФайла);
		ЗаполнитьЗначенияСвойств(ОписаниеФайла, ИнформацияОФайле);
	КонецЕсли;
	
	Возврат ОписаниеФайла;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция HTTPСоединениеСМоделью(ПараметрыСоединения)
	
	ИнтернетПрокси = Неопределено;
	
	ПараметрыПрокси = ПараметрыСоединения.ПараметрыПрокси;
	Если ПараметрыПрокси.ИспользоватьПрокси Тогда
		ИнтернетПрокси = Новый ИнтернетПрокси;
		Порт           = ?(ЗначениеЗаполнено(ПараметрыПрокси.Порт), ПараметрыПрокси.Порт, Неопределено);
		Протоколы      = СтрРазделить("http,https", ",", Ложь);
		Для каждого Протокол Из Протоколы Цикл
			ИнтернетПрокси.Установить(Протокол, ПараметрыПрокси.Сервер, Порт, 
				ПараметрыПрокси.Пользователь, ПараметрыПрокси.Пароль, ПараметрыПрокси.ИспользоватьАутентификациюОС);
		КонецЦикла;
	Иначе
		#Если Сервер ИЛИ ВнешнееСоединение Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
			МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
			ИнтернетПрокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
		КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	ЗащищенноеСоединение = Неопределено;
	Если ПараметрыСоединения.ИспользоватьБезопасноеСоединение Тогда
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	КонецЕсли;
	
	Возврат Новый HTTPСоединение(ПараметрыСоединения.АдресСервера, ПараметрыСоединения.Порт,,, ИнтернетПрокси,,
									ЗащищенноеСоединение);
	
КонецФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(ОписаниеОшибки)
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Взаимодейсвтвие с AI'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
	#Иначе
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
			НСтр("ru = 'Взаимодейсвтвие с AI'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()),
			"Ошибка", ОписаниеОшибки,, Истина);
	#КонецЕсли
	
КонецПроцедуры

#Область ИнтеграцияСGemini

Функция РезультатГенерацииGemini(ПараметрыВзаимодействия)
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	ПараметрыСервера = ПараметрыВзаимодействия.ПараметрыСервера;
	ПараметрыЗапроса.АдресСервера = ПараметрыСервера.Сервер; 
	ПараметрыЗапроса.Порт         = ПараметрыСервера.Порт;
	ПараметрыЗапроса.АдресРесурса = ПараметрыСервера.Ресурс;
	ПараметрыЗапроса.ИспользоватьБезопасноеСоединение = ПараметрыСервера.ИспользоватьБезопасноеСоединение;
	ПараметрыЗапроса.ПараметрыПрокси = ПараметрыВзаимодействия.ПараметрыПрокси;
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");
	Если НЕ ПустаяСтрока(ПараметрыВзаимодействия.КлючAPI) Тогда
		ПараметрыЗапроса.Заголовки.Вставить("X-Goog-Api-Key", ПараметрыВзаимодействия.КлючAPI);
	КонецЕсли;
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("system_instruction", Новый Структура("parts", Новый Массив));
	ТелоЗапроса.Вставить("contents",           Новый Массив);
	
	Инструкции = ТелоЗапроса.system_instruction.parts;
	Если НЕ ПустаяСтрока(ПараметрыВзаимодействия.Поведение) Тогда
		Инструкции.Добавить(Новый Структура("text", ПараметрыВзаимодействия.Поведение));
	КонецЕсли;
	Если НЕ ПустаяСтрока(ПараметрыВзаимодействия.ТехническиеУказания) Тогда
		Инструкции.Добавить(Новый Структура("text", ПараметрыВзаимодействия.ТехническиеУказания));
	КонецЕсли;
	
	Диалог = ТелоЗапроса.contents;
	Если ТипЗнч(ПараметрыВзаимодействия.ЗапросПользователя) = Тип("Строка") Тогда
		БлокСообщений = Новый Структура("parts", Новый Массив);
		Сообщение     = Новый Структура("text", ПараметрыВзаимодействия.ЗапросПользователя);
		БлокСообщений.parts.Добавить(Сообщение);
		Диалог.Добавить(БлокСообщений);
	ИначеЕсли ТипЗнч(ПараметрыВзаимодействия.ЗапросПользователя) = Тип("Массив") Тогда
		ТекстовыеЗапросы = Новый Массив;
		ВложенияЗапроса  = Новый Массив;
		Для каждого СтрокаЗапроса Из ПараметрыВзаимодействия.ЗапросПользователя Цикл
			Роль             = "user";
			ОписаниеВложения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтрокаЗапроса, "ОписаниеВложения", "");
			Если НЕ ПустаяСтрока(ОписаниеВложения) И СтрокаЗапроса.Свойство("ДанныеВложения") Тогда
				ОбработкаТекстсовымПромптом = Неопределено;
				ОбработатьДобавитьВложенияGemini(СтрокаЗапроса, ПараметрыВзаимодействия, ТекстовыеЗапросы, ВложенияЗапроса,
					ОбработкаТекстсовымПромптом);
				Если ОбработкаТекстсовымПромптом <> Истина Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли СтрокаЗапроса.Роль = ПредопределенноеЗначение("Перечисление.бит_РолиВзаимодействияИИ.Notice") Тогда
				Продолжить;
			Иначе
				Если СтрокаЗапроса.Роль = ПредопределенноеЗначение("Перечисление.бит_РолиВзаимодействияИИ.Assistant") Тогда
					Роль = "model";
				КонецЕсли;
				ТекстовыеЗапросы.Добавить(СтрокаЗапроса.Содержание);
			КонецЕсли;
			
			Части = Новый Массив;
			Для каждого ТекстЗапроса Из ТекстовыеЗапросы Цикл
				Части.Добавить(Новый Структура("text", ТекстЗапроса));
			КонецЦикла;
			ТекстовыеЗапросы.Очистить();
			Для каждого ВложениеЗапроса Из ВложенияЗапроса Цикл
				Если ПараметрыВзаимодействия.МетодОбработкиВложений =
						ПредопределенноеЗначение("Перечисление.бит_МетодыОбработкиВложений.СтрокаBase64") Тогда
					ОписаниеДанныхФайла = Новый Структура("mime_type, data");
					ЗаполнитьЗначенияСвойств(ОписаниеДанныхФайла, ВложениеЗапроса);
					СтруктураДанныхФайла = Новый Структура("inlineData", ОписаниеДанныхФайла);
					Части.Добавить(СтруктураДанныхФайла);
				Иначе
					ОписаниеДанныхФайла = Новый Структура("mime_type, file_uri");
					ЗаполнитьЗначенияСвойств(ОписаниеДанныхФайла, ВложениеЗапроса);
					СтруктураДанныхФайла = Новый Структура("file_data", ОписаниеДанныхФайла);
					Части.Добавить(СтруктураДанныхФайла);
				КонецЕсли;
			КонецЦикла;
			ВложенияЗапроса.Очистить();
			Сообщение = Новый Структура("role, parts", Роль, Части);
			Диалог.Добавить(Сообщение);
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыЗапроса.ТелоЗапроса = ЗначениеВJSON(ТелоЗапроса);

	Результат = РезультатHTTPЗапроса(ПараметрыЗапроса);
	Если Результат.ЗапросВыполнен Тогда
		ОтветСервера = Результат.ОтветСервера;
		ОтветСервера = ОтветСервера["candidates"][0]["content"]["parts"][0]["text"];
		Результат.ОтветСервера = ОтветСервера;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьДобавитьВложенияGemini(СтрокаЗапроса, ПараметрыВзаимодействия, ТекстовыеЗапросы, ВложенияЗапроса,
	ОбработкаТекстсовымПромптом)
	
	ОбработкаТекстсовымПромптом = Ложь;
	
	ОписаниеВложения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтрокаЗапроса, "ОписаниеВложения", "");
	Если ПустаяСтрока(ОписаниеВложения) ИЛИ НЕ СтрокаЗапроса.Свойство("ДанныеВложения") Тогда
		Возврат;
	КонецЕсли;

	ДанныеВложения = СтрокаЗапроса.ДанныеВложения;
	Если ТипЗнч(ДанныеВложения) = Тип("ХранилищеЗначения") Тогда
		Вложение = ДанныеВложения.Получить();
	ИначеЕсли ТипЗнч(ДанныеВложения) = Тип("Строка")
		И ЭтоАдресВременногоХранилища(ДанныеВложения) Тогда
		Вложение = ПолучитьИзВременногоХранилища(ДанныеВложения);
	Иначе
		Вложение = ДанныеВложения;
	КонецЕсли;

	Если ТипЗнч(Вложение) = Тип("ДвоичныеДанные") Тогда
		ОписаниеФайла = НовоеОписаниеФайлаВыгрузки();
		ЗаполнитьЗначенияСвойств(ОписаниеФайла, JSONВЗначение(ОписаниеВложения,, Ложь));
		
		РезультатВыгрузки = ВыгрузитьФайлВGemini(Вложение, ОписаниеФайла, ПараметрыВзаимодействия);
		Если НЕ РезультатВыгрузки.Отказ Тогда
			ВложенияЗапроса.Добавить(РезультатВыгрузки);
		КонецЕсли;
	Иначе
		ТекстовыеЗапросы.Добавить(ОписаниеВложения);
		ТекстовыеЗапросы.Добавить(Вложение);
		ОбработкаТекстсовымПромптом = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ВыгрузитьФайлВGemini(ДвоичныеДанныеФайла, ОписаниеФайла, ПараметрыВзаимодействия)
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ",      Ложь);
	Результат.Вставить("mime_type",  "");
	Результат.Вставить("file_uri",   "");
	Результат.Вставить("data",       "");
	
	ТипФайла = MIMEТипФайла(ОписаниеФайла);
	Результат.mime_type = ТипФайла;
	
	Если ПараметрыВзаимодействия.МетодОбработкиВложений =
		ПредопределенноеЗначение("Перечисление.бит_МетодыОбработкиВложений.СтрокаBase64") Тогда
		Результат.data = Base64Строка(ДвоичныеДанныеФайла);
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	
	ПараметрыСервера = ПараметрыВзаимодействия.ПараметрыСервера;
	ПараметрыЗапроса.АдресСервера = ПараметрыСервера.Сервер; 
	ПараметрыЗапроса.Порт         = ПараметрыСервера.Порт;
	ПараметрыЗапроса.АдресРесурса = ПараметрыВзаимодействия.АдресРесурсаФайлов;
	ПараметрыЗапроса.ИспользоватьБезопасноеСоединение = ПараметрыСервера.ИспользоватьБезопасноеСоединение;
	ПараметрыЗапроса.ПараметрыПрокси = ПараметрыВзаимодействия.ПараметрыПрокси;
	
	Если НЕ ПустаяСтрока(ПараметрыВзаимодействия.КлючAPI) Тогда
		ПараметрыЗапроса.Заголовки.Вставить("X-Goog-Api-Key", ПараметрыВзаимодействия.КлючAPI);
	КонецЕсли;
	ПараметрыЗапроса.Заголовки.Вставить("X-Goog-Upload-Protocol", "raw");
	ПараметрыЗапроса.Заголовки.Вставить("X-Goog-Upload-Header-Content-Length", ДвоичныеДанныеФайла.Размер());
	ПараметрыЗапроса.Заголовки.Вставить("X-Goog-Upload-Header-Content-Type",   ТипФайла);
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", ТипФайла);
    
	ПодготовитьHTTPЗапросДляРаботыСПотоком(ПараметрыЗапроса);
	
	ТелоЗапроса  = ПараметрыЗапроса.HTTPЗапрос.ПолучитьТелоКакПоток();
	ЗаписьДанных = Новый ЗаписьДанных(ТелоЗапроса, КодировкаТекста.UTF8, ПорядокБайтов.LittleEndian, "", "", Ложь);

	РазделительСтрок = Символы.ВК + Символы.ПС;
	Разделитель      = "--" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");

	ЗаписьДанных.ЗаписатьСтроку(Разделитель + РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""purpose""");
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку("assistants");
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку(Разделитель + РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""file""; display_name=""" + ОписаниеФайла.Имя + """");
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку(СтрШаблон("Content-Type: %1", ТипФайла));
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.Записать(ДвоичныеДанныеФайла);
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);

	ЗаписьДанных.ЗаписатьСтроку(Разделитель + "--" + РазделительСтрок);
	ЗаписьДанных.Закрыть();
	
	РезультатВыгрузкиФайла = РезультатHTTPЗапроса(ПараметрыЗапроса);
	Если НЕ РезультатВыгрузкиФайла.ЗапросВыполнен Тогда
		Результат.Отказ = Истина;
		Возврат Результат;
	КонецЕсли;
	
	Результат.file_uri = РезультатВыгрузкиФайла.ОтветСервера["file"]["uri"];
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ТелоЗапросаКМодели(ПараметрыВзаимодействия)
	
	ПараметрыЗапроса = Новый Структура;
	Если ПараметрыВзаимодействия.ЭтоЯндекс Тогда
		ШаблонМодели = "gpt://%1/%2/latest";
		ПараметрыЗапроса.Вставить("modelUri", СтрШаблон(ШаблонМодели,
			ПараметрыВзаимодействия.ИдентификаторКаталога, НРег(ПараметрыВзаимодействия.ВидМодели)));
			
		НастройкиГенерации = Новый Структура;
		НастройкиГенерации.Вставить("stream", Ложь);
		НастройкиГенерации.Вставить("temperature", ПараметрыВзаимодействия.Температура);
		ПараметрыЗапроса.Вставить("completionOptions", НастройкиГенерации);
	Иначе
		ПараметрыЗапроса.Вставить("model",       НРег(ПараметрыВзаимодействия.ВидМодели));
		ПараметрыЗапроса.Вставить("temperature", ПараметрыВзаимодействия.Температура);
	КонецЕсли;
	ПараметрыЗапроса.Вставить("messages", БлокСообщенийКМодели(ПараметрыВзаимодействия));
	Если ПараметрыВзаимодействия.ЭтоСбер Тогда
		ОбработатьФорматВложенийДляСбера(ПараметрыЗапроса);
	КонецЕсли;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция БлокСообщенийКМодели(ПараметрыВзаимодействия)
	
	Сообщения = Новый Массив;
	ДобавитьСообщение(Сообщения, "system", ПараметрыВзаимодействия.Поведение, ПараметрыВзаимодействия);
	ДобавитьСообщение(Сообщения, "system", ПараметрыВзаимодействия.ТехническиеУказания, ПараметрыВзаимодействия);
	Если ТипЗнч(ПараметрыВзаимодействия.ЗапросПользователя) = Тип("Строка") Тогда
		ДобавитьСообщение(Сообщения, "user", ПараметрыВзаимодействия.ЗапросПользователя, ПараметрыВзаимодействия);
	ИначеЕсли ТипЗнч(ПараметрыВзаимодействия.ЗапросПользователя) = Тип("Массив") Тогда
		Для каждого СтрокаЗапроса Из ПараметрыВзаимодействия.ЗапросПользователя Цикл
			ОписаниеВложения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтрокаЗапроса, "ОписаниеВложения", "");
			Если НЕ ПустаяСтрока(ОписаниеВложения) И СтрокаЗапроса.Свойство("ДанныеВложения") Тогда
				ДанныеВложения = СтрокаЗапроса.ДанныеВложения;
				Если ТипЗнч(ДанныеВложения) = Тип("ХранилищеЗначения") Тогда
					Вложение = ДанныеВложения.Получить();
				ИначеЕсли ТипЗнч(ДанныеВложения) = Тип("Строка")
					И ЭтоАдресВременногоХранилища(ДанныеВложения) Тогда
					Вложение = ПолучитьИзВременногоХранилища(ДанныеВложения);
				Иначе
					Вложение = ДанныеВложения;
				КонецЕсли;
				ДобавитьВложение(Сообщения, Вложение, ОписаниеВложения, ПараметрыВзаимодействия);
			КонецЕсли;
			
			Если СтрокаЗапроса.Роль <> ПредопределенноеЗначение("Перечисление.бит_РолиВзаимодействияИИ.Notice") Тогда
				ДобавитьСообщение(Сообщения, НРег(СтрокаЗапроса.Роль), СтрокаЗапроса.Содержание, ПараметрыВзаимодействия);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Сообщения;
	
КонецФункции

Процедура ДобавитьСообщение(Сообщения, Знач Роль, Содержание, ПараметрыВзаимодействия)
	
	Если ТипЗнч(Содержание) = Тип("Строка") И ПустаяСтрока(Содержание) Тогда
		Возврат;
	КонецЕсли;
	
	Если Роль = "developer" Тогда
		Роль = "system";
	КонецЕсли;
		
	КлючПараметраСодержация = "content";
	Если ПараметрыВзаимодействия.ЭтоЯндекс Тогда
		КлючПараметраСодержация = "text";
	ИначеЕсли ПараметрыВзаимодействия.ЭтоСбер Тогда
		Если Сообщения.Количество() > 0 Тогда
			// GigaChat признает только 1н системный промт и только первым по списку.
			Роль = "user";
		КонецЕсли;
	КонецЕсли;
	
	Сообщение = Новый Структура;
	Сообщение.Вставить("role", Роль);
	Сообщение.Вставить(КлючПараметраСодержация, Содержание);
		
	Сообщения.Добавить(Сообщение);
	
КонецПроцедуры

Процедура ДобавитьВложение(Сообщения, ДанныеВложения, ОписаниеВложения, ПараметрыВзаимодействия)
	
	ДанныеСтрокой     = "";
	ЭтоДвоичныеДанные = (ТипЗнч(ДанныеВложения) = Тип("ДвоичныеДанные"));
	Если ЭтоДвоичныеДанные Тогда
		ОписаниеФайла = НовоеОписаниеФайлаВыгрузки();
		ЗаполнитьЗначенияСвойств(ОписаниеФайла, JSONВЗначение(ОписаниеВложения,, Ложь));
		Если ПараметрыВзаимодействия.МетодОбработкиВложений =
				ПредопределенноеЗначение("Перечисление.бит_МетодыОбработкиВложений.СтрокаBase64") Тогда
			Контент = Новый Массив;
			КонтейнерФайла = Новый Структура;
			КонтейнерФайла.Вставить("type", "file");
			Base64Описание = СтрШаблон("data:%1;base64,%2", MIMEТипФайла(ОписаниеФайла), Base64Строка(ДанныеВложения));
			КонтейнерФайла.Вставить("file", Новый Структура("filename, file_data", ОписаниеФайла.Имя, Base64Описание));
			Контент.Добавить(КонтейнерФайла);
			
			ДобавитьСообщение(Сообщения, "user", Контент, ПараметрыВзаимодействия);
			Возврат;
		ИначеЕсли ПараметрыВзаимодействия.МетодОбработкиВложений =
				ПредопределенноеЗначение("Перечисление.бит_МетодыОбработкиВложений.СервисРаспознавания") Тогда
			ПромтОписаниеВложения = НСтр("ru='Сообщением ниже передано содержание файла, распознанное внешним сервисом.'");
			бит_ИскусственныйИнтеллектВызовСервера.РаспознатьДокумент(ДанныеВложения, ДанныеСтрокой, ОписаниеВложения, ПараметрыВзаимодействия);
		ИначеЕсли ПараметрыВзаимодействия.МетодОбработкиВложений =
				ПредопределенноеЗначение("Перечисление.бит_МетодыОбработкиВложений.APIМодели") Тогда
			РезультатЗапроса = ПередатьФайлНаСервисПоставщика(ПараметрыВзаимодействия, ДанныеВложения, ОписаниеФайла);
			Если РезультатЗапроса.ЗапросВыполнен Тогда
				ИдентификаторФайла = РезультатЗапроса.ОтветСервера["id"];
				
				Контент = Новый Массив;
				КонтейнерФайла = Новый Структура;
				КонтейнерФайла.Вставить("type", "file");
				КонтейнерФайла.Вставить("file", Новый Структура("file_id", ИдентификаторФайла));
				Контент.Добавить(КонтейнерФайла);
				
				Сообщение = Новый Структура;
				Сообщение.Вставить("role",    "user");
				Сообщение.Вставить("content", Контент);
				Сообщения.Добавить(Сообщение);
				Возврат;
			КонецЕсли;
			
			Запрос = Новый HTTPЗапрос;
			Запрос.УстановитьТелоИзДвоичныхДанных(ДанныеВложения);
			ДанныеСтрокой = Запрос.ПолучитьТелоКакСтроку();
		КонецЕсли;
	Иначе
		ПромтОписаниеВложения = СтрШаблон("%1. %2", НСтр("ru='Сообщением ниже переданы двоичные данные файла.'"),
											ОписаниеВложения);
		ДанныеСтрокой = ДанныеВложения;
	КонецЕсли;
	
	ДобавитьСообщение(Сообщения, "system", ПромтОписаниеВложения, ПараметрыВзаимодействия);
	ДобавитьСообщение(Сообщения, "system", ДанныеСтрокой, ПараметрыВзаимодействия);
	
КонецПроцедуры

Функция ПередатьФайлНаСервисПоставщика(ПараметрыВзаимодействия, ДвоичныеДанныеФайла, ОписаниеФайла)
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	
	ПараметрыСервера = ПараметрыВзаимодействия.ПараметрыСервера;
	ПараметрыЗапроса.АдресСервера = ПараметрыСервера.Сервер; 
	ПараметрыЗапроса.Порт         = ПараметрыСервера.Порт;
	ПараметрыЗапроса.АдресРесурса = ПараметрыВзаимодействия.АдресРесурсаФайлов;
	ПараметрыЗапроса.ИспользоватьБезопасноеСоединение = ПараметрыСервера.ИспользоватьБезопасноеСоединение;
	ПараметрыЗапроса.ПараметрыПрокси = ПараметрыВзаимодействия.ПараметрыПрокси;
	
	
	Boundary         = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	Если НЕ ПустаяСтрока(ПараметрыВзаимодействия.КлючAPI) Тогда
		ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer " + ПараметрыВзаимодействия.КлючAPI);
	КонецЕсли;
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",  "multipart/form-data; boundary="+Boundary);
	
	ПодготовитьHTTPЗапросДляРаботыСПотоком(ПараметрыЗапроса);
	
	ТелоЗапроса  = ПараметрыЗапроса.HTTPЗапрос.ПолучитьТелоКакПоток();
	
	ЗаписьДанных = Новый ЗаписьДанных(ТелоЗапроса, КодировкаТекста.UTF8, ПорядокБайтов.LittleEndian, "", "", Ложь);
	
	РазделительСтрок = Символы.ВК + Символы.ПС;
	Разделитель      = "--" + Boundary;
	
	ЗаписьДанных.ЗаписатьСтроку(Разделитель + РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""purpose""");
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку(?(ПараметрыВзаимодействия.ЭтоСбер, "general", "assistants"));
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку(Разделитель + РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""file""; filename="""+ОписаниеФайла.Имя+"""");
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку(СтрШаблон("Content-Type: %1", MIMEТипФайла(ОписаниеФайла)));
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	ЗаписьДанных.Записать(ДвоичныеДанныеФайла);
	ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);

	ЗаписьДанных.ЗаписатьСтроку(Разделитель + "--" + РазделительСтрок);
	ЗаписьДанных.Закрыть();
	
	Результат = РезультатHTTPЗапроса(ПараметрыЗапроса);
	Возврат Результат;
	
КонецФункции

Функция MIMEТипФайла(ОписаниеФайла)
	
	MIMEТипы = Новый Соответствие;
	MIMEТипы.Вставить(".txt",  "text/plain");
	MIMEТипы.Вставить(".doc",  "application/msword");
	MIMEТипы.Вставить(".docx", "application/vnd.openxmlformats-officedocument.wordprocessingml.document");
	MIMEТипы.Вставить(".pdf",  "application/pdf");
	MIMEТипы.Вставить(".epub", "application/epub");
	MIMEТипы.Вставить(".ppt",  "application/ppt");
	MIMEТипы.Вставить(".pptx", "application/pptx");
	
	MIME = MIMEТипы.Получить(ОписаниеФайла.Расширение);
	Если MIME = Неопределено Тогда
		MIME = "text/plain";
	КонецЕсли;
	
	Возврат MIME;
	
КонецФункции

Процедура ОбработатьФорматВложенийДляСбера(ПараметрыЗапроса)
	
	Сообщения = ПараметрыЗапроса.messages;
	Для Сч = 1 - Сообщения.Количество() По 0 Цикл
		ИндексЭлемента = (-Сч);
		Содержание = Сообщения.Получить(ИндексЭлемента).content;
		Если ТипЗнч(Содержание) <> Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		
		Контейнер = Содержание[0];
		Если ТипЗнч(Контейнер) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контейнер, "type") <> "file" Тогда
			Продолжить;
		КонецЕсли;
		
		Вложения  = Новый Массив;
		Вложения.Добавить(Контейнер.file.file_id);
		Сообщение = Сообщения.Получить(ИндексЭлемента + 1);
		Сообщение.Вставить("attachments", Вложения);
		
		Сообщения.Удалить(ИндексЭлемента);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВставитьПереносыСтрокHTML(Текст)
	
	Текст = СтрЗаменить(Текст, Символы.ПС, Символы.ПС + "<br>");
	
КонецПроцедуры

Процедура ВыделитьКурсивHTML(Текст)
	
	ШаблонВыделения = "%1<b>%2</b>%3";
	Пока Истина Цикл
		НачалоВыделенияЖирным = СтрНайти(Текст, "**");
		Если НачалоВыделенияЖирным = 0 Тогда
			Прервать;
		КонецЕсли;
		ПозицияПоискаОкончания = НачалоВыделенияЖирным + 1;
		Если ПозицияПоискаОкончания >= СтрДлина(Текст) Тогда
			Прервать;
		КонецЕсли;
		ОкончаниеВыделенияЖирным = СтрНайти(Текст, "**",, ПозицияПоискаОкончания);
		Если ОкончаниеВыделенияЖирным = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Текст = СтрШаблон(ШаблонВыделения, Лев(Текст, НачалоВыделенияЖирным-1),
				Сред(Текст, НачалоВыделенияЖирным + 2, ОкончаниеВыделенияЖирным - НачалоВыделенияЖирным - 2),
				Сред(Текст, ОкончаниеВыделенияЖирным + 2));
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыделитьЗаголовкиHTML(Текст)
	
	ВыделитьЗаголовокHTML(Текст, "#### ", "4");
	ВыделитьЗаголовокHTML(Текст, "### ", "5");
	ВыделитьЗаголовокHTML(Текст, "## ", "6");
	ВыделитьЗаголовокHTML(Текст, "# ", "7");
		
КонецПроцедуры

Процедура ВыделитьЗаголовокHTML(Текст, Маска, РазмерШрифта)
	
	ШаблонЗаголовка = "%1<span style=""font-size: %4;"">%2</span>%3";
	
	Пока Истина Цикл
		ПозицияНачалаЗаголовка = СтрНайти(Текст, Маска);
		Если ПозицияНачалаЗаголовка = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ТекстДоЗаголовока = "";
		Если ПозицияНачалаЗаголовка > 1 Тогда
			ТекстДоЗаголовока = Лев(Текст, ПозицияНачалаЗаголовка - 1); 
		КонецЕсли;
		ПозицияНачалаЗаголовка = ПозицияНачалаЗаголовка + СтрДлина(Маска); 
		
		ПозицияОкончанияЗаголовка = СтрНайти(Текст, Символы.ПС,, ПозицияНачалаЗаголовка);
		Если ПозицияОкончанияЗаголовка = 0 Тогда
			ПозицияОкончанияЗаголовка = СтрДлина(Текст);
		КонецЕсли;
		
		Текст = СтрШаблон(ШаблонЗаголовка, ТекстДоЗаголовока,
				Сред(Текст, ПозицияНачалаЗаголовка, ПозицияОкончанияЗаголовка - ПозицияНачалаЗаголовка),
				Сред(Текст, ПозицияОкончанияЗаголовка), РазмерШрифта);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
